000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СообщениеКлиенту/СообщениеКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщениеКлиенту</name>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.ТипыСообщенийКлиенту</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСообщения</name>
    <type>
      <types>EnumRef.СостояниеСообщенийКлиенту</types>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСледующейОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ТегиСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыСообщенийКлиенту/ТипыСообщенийКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСообщенийКлиенту</name>
  <enumValues>
    <name>SMS</name>
  </enumValues>
  <enumValues>
    <name>Viber</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СостояниеСообщенийКлиенту/СостояниеСообщенийКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеСообщенийКлиенту</name>
  <enumValues>
    <name>Создано</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Доставлено</name>
  </enumValues>
  <enumValues>
    <name>Перенаправлено</name>
  </enumValues>
  <enumValues>
    <name>Новое</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ОбменСБанкамиLiqPayСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Оплатить на сервере.
// 
// Параметры:
//  НомерЗаказа - Строка - Номер заказа
//  СсылкаНаДокумент - ДокументСсылка.ЗаказПокупателя - Ссылка на документ
//  НомерТелефонаКлиента - Строка - Номер телефона клиента
//  НомерОплаты - Число - Номер оплаты
//  СуммаОплаты - Число - Сумма оплаты
//  ПрошлыйИД - Строка - Прошлый ИД
//  НоваяОплата - Булево - Новая оплата
// 
// Возвращаемое значение:
//  Строка - Уникальный идентификатор оплаты
Функция ОплатитьНаСервере(НомерЗаказа, СсылкаНаДокумент, НомерТелефонаКлиента, НомерОплаты, СуммаОплаты, ПрошлыйИД, НоваяОплата = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеLiqPay = ОбменСБанкамиПовтИсп.ДанныеLiqPay();
	
 	АдресСайта = ДанныеLiqPay.АдресСайта;
	Порт = ДанныеLiqPay.Порт;
	Логин = ДанныеLiqPay.Логин;
	Пароль = ДанныеLiqPay.Пароль;
	ИмяКаталога = "/";
	FTPСоединение = Новый FTPСоединение(АдресСайта,Порт,Логин,Пароль);
	FTPСоединение.УстановитьТекущийКаталог(ИмяКаталога);
	FTPСоединение.Удалить(ИмяКаталога, ПрошлыйИД + ".html");  
	
	Order_УН = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");

	Если НоваяОплата Тогда 
	
		Order_id = СокрЛП(НомерЗаказа) + ?(НомерОплаты = 0, "", "-" + Строка(НомерОплаты));
		Summa = Формат(СуммаОплаты, "ЧРД=.; ЧГ=0");
		
		Public_key = ДанныеLiqPay.public_key; 
		
		СтруктураЗапроса = Новый Структура;
		СтруктураЗапроса.Вставить("action", "pay");
		СтруктураЗапроса.Вставить("amount", Summa);
		СтруктураЗапроса.Вставить("currency", "UAH");
		СтруктураЗапроса.Вставить("description", "Заказ № " + Order_id);
		СтруктураЗапроса.Вставить("order_id", Order_id);
		СтруктураЗапроса.Вставить("version", "3");
		СтруктураЗапроса.Вставить("server_url", "https://cbone.antoshka.ua/" + Order_УН);
		СтруктураЗапроса.Вставить("public_key", Public_key); 
		
		ЗаписьJSON = Новый ЗаписьJSON; 
	    ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет)); 
		ЗаписатьJSON(ЗаписьJSON,СтруктураЗапроса);
	    СтрокаJSON = ЗаписьJSON.Закрыть();
	    СтрокаJSON = СтрЗаменить(СтрокаJSON, " ", "");
		
		ДанныеДляОтправки = ОбменСБанкамиСервер.СформироватьДанныеLiqPay(СтрокаJSON);
		
		ТекстДокумента = "<!DOCTYPE html>";
		ТекстДокумента = ТекстДокумента + "<html><head><title>Головна сторінка сайту</title></head>";
		ТекстДокумента = ТекстДокумента + "<body><h1>Замовлення № " + Order_id + ". Сума оплати: " + Формат(Summa, "ЧРД=.; ЧГ=0;") + " грн.</h1>";
		ТекстДокумента = ТекстДокумента + "<form method='post' action='https://www.liqpay.ua/api/3/checkout/' accept-charset='utf-8'>";
		ТекстДокумента = ТекстДокумента + "<input type='hidden' name='data' value='" + ДанныеДляОтправки.Данные + "'/>";
		ТекстДокумента = ТекстДокумента + "<input type='hidden' name='signature' value='" + ДанныеДляОтправки.Сигнатура + "'/>";
		ТекстДокумента = ТекстДокумента + "<input type='image' src='//static.liqpay.ua/buttons/payUk.png' name='btn_text' />";
		ТекстДокумента = ТекстДокумента + "</form></body></html>";
		
		ТекстовыйДок = Новый ТекстовыйДокумент;
		ТекстовыйДок.ДобавитьСтроку(ТекстДокумента);
		ВременныйФайл = ПолучитьИмяВременногоФайла();
		ТекстовыйДок.Записать(ВременныйФайл);
		FTPСоединение.Записать(ВременныйФайл, Order_УН + ".html");
		
		ДатаСообщения = ТекущаяДатаСеанса();
		
		ТекстСообщенияКлиенту = "Посилання для сплати https://cbone.antoshka.ua/" + Order_УН; 
		
		СтруктураСообщенияКлиенту = РегистрыСведений.СообщениеКлиенту.СтруктураЗаписиРегистра(); 
		
		СтруктураСообщенияКлиенту.Дата 						= ДатаСообщения;
		СтруктураСообщенияКлиенту.ИДСообщения 				= "Новое";
		СтруктураСообщенияКлиенту.ТекстСообщения 			= ТекстСообщенияКлиенту;
		СтруктураСообщенияКлиенту.ТипСообщения 				= Перечисления.ТипыСообщенийКлиенту.Viber;
		СтруктураСообщенияКлиенту.СостояниеСообщения 		= Перечисления.СостояниеСообщенийКлиенту.Новое;
		СтруктураСообщенияКлиенту.Телефон 					= НомерТелефонаКлиента;
		СтруктураСообщенияКлиенту.ДатаСледующейОтправки 	= ДатаСообщения; 
		
		РегистрыСведений.СообщениеКлиенту.ЗаписьСообщенияВРегистр(СтруктураСообщенияКлиенту);  
		
		РегистрыСведений.КомментарийИнтернетЗаказа.ЗаписьКомментария(СсылкаНаДокумент, ПараметрыСеанса.ТекущийПользователь, ТекстСообщенияКлиенту);
		
		УдалитьФайлы(ВременныйФайл);
	КонецЕсли;
	Возврат Order_УН;

КонецФункции


#КонецОбласти
